# Ex03.py
#입력된 숫자가 짝수인지 홀수인지 판별하는 프로그램

# a=int(input('숫자를 입력하세요>'))
# if(a%2!=0):
#     print("홀수입니다.")
# else:
#     print("짝수입니다.")

###################################################################
# 입력된 숫자열이 짝수인지 홀수인지 판별해서 홀수만 출력하는 프로그램
###################################################################

list_a = input('숫자열을 공백을 두고 입력하시오: >')
splited = list_a.split(' ')
mapped_list=list(map(int, splited))
print(mapped_list)
for i in mapped_list:
    if i % 2 !=0:
        print(f"{i }")


